БухЭксп/Reports/CW_ПланФакторныйАнализГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ПланФакторныйАнализГрузоперевозок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Enums/CW_НаправлениеСортировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_НаправлениеСортировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВозрастанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУбыванию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Reports/CW_ПланФакторныйАнализГрузоперевозок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);	
	// --- 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок",ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ПоАктам",?(Настройки["ВариантФормирования"]=0,Истина,Ложь));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Грузоперевозки",Настройки["Грузоперевозки"]);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВерсияБюджета",?(Настройки["ВерсияБюджета"].Пустая(),Справочники.CW_ВерсииБюджетов.Основная,Настройки["ВерсияБюджета"]));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Организация",?(Настройки["Организация"].Пустая(),Неопределено,Настройки["Организация"]));
	
	// 
	
	// обрабатываем разделы и показатели
	Для каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		
		Если ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			
			Поле.Использование = ?(Настройки.Разделы.НайтиПоЗначению(Строка(Поле.Поле)) <> Неопределено, Настройки.Разделы.НайтиПоЗначению(Строка(Поле.Поле)).Пометка, Ложь);
			Если Поле.Использование Тогда
				
				// проходим по подчинённым элементам
				Для каждого Показатель Из Поле.Элементы Цикл
					
					ИмяПоля = СтрЗаменить(Строка(Показатель.Поле),Строка(Поле.Поле)+"."+Строка(Поле.Поле),"");
					Показатель.Использование = Настройки.Показатели.НайтиПоЗначению(ИмяПоля).Пометка;
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		Иначе
			
			Если Поле.Поле = Новый ПолеКомпоновкиДанных("СтатьяЗатрат") Тогда
				
				Поле.Использование = Настройки.ПоСтатьям;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// формируем группировки:
	// если "ПоСтатья", то статья - номенклатура
	// иначе просто по номенклатуре
	
	Группировки = _сф.т_Создать("ИмяПоля,Сортировка,Представление");
	
	Нстр = Группировки.Добавить();
	// --- 
	Нстр.ИмяПоля = "Вид";
	Нстр.Представление = "Вид";
	Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
	
	Если Настройки.ПоСтатьям Тогда
		
		Нстр = Группировки.Добавить();
		Нстр.ИмяПоля = "СтатьяЗатрат";
		Нстр.Представление = "Статья";
		Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		// --- 
		
	КонецЕсли; 
	
	Нстр = Группировки.Добавить();
	Нстр.ИмяПоля = "Номенклатура";
	Нстр.Представление = "Номенклатура";
	Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
	
	// группировки
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	Для каждого Группировка Из Группировки Цикл
		
		// ГруппировкаКомпоновкиДанных
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		// --- 
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		// --- 
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка=Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		// --- 
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		// --- 
		ТекущийРодитель = НоваяГруппировка.Структура;
		
	КонецЦикла;
		
КонецПроцедуры
#КонецЕсли
